PRAGMA foreign_keys = ON;

BEGIN;

-- پروژه نمونه (اگر پروژه شما T202 است همین خوبه)
INSERT OR IGNORE INTO projects(project_code, project_name, root_path, is_active, docnum_template)
VALUES ('T202', 'My Project', 'D:\MDR_ARCHIVE\T202', 1, '{PROJECT}-{MDR}{PKG}-{BLK}{LVL}');

-- MDR Categories
INSERT OR IGNORE INTO mdr_categories(name, letter) VALUES
('Engineering','E'),
('Procurement','P'),
('Construction','C');

-- Phases
INSERT OR IGNORE INTO phases(ph_name_e, ph_name_p, ph_code) VALUES
('Pre Design','مطالعات و پیش طراحی(فاز صفر و کانسپت)','P'),
('Schematic Design','طراحی شماتیک(فاز یک)','S'),
('Design Development','توسعه طرح(فاز یک و نیم)','D'),
('Construction Document','مدارک اجرایی(فاز دو)','C'),
('Building Permit','اخد مجوز ها(-)','B'),
('Bid & Negotitation','برگزاری مناقصه(فاز سه)','N'),
('Construction Administration','ساخت(فاز سه)','A');

-- Levels (GEN را با code خالی می‌گذاریم)
INSERT OR IGNORE INTO levels(name_e, name_p, code, sort_order) VALUES
('GEN','',NULL,-1),
('B09','زیرزمین نهم',0,0),
('B08','زیرزمین هشتم',1,1),
('B07','زیرزمین هفتم',2,2),
('B06','زیرزمین ششم',3,3),
('B05','زیرزمین پنجم',4,4),
('B04','زیرزمین چهارم',5,5),
('B03','زیرزمین سوم',6,6),
('B02','زیرزمین دوم',7,7),
('B01','زیرزمین اول',8,8),
('GFL','همکف',9,9),
('L01','طبقه اول',10,10),
('L02','طبقه دوم',11,11),
('L03','طبقه سوم',12,12),
('L04','طبقه چهارم',13,13),
('L05','طبقه پنجم',14,14),
('L06','طبقه ششم',15,15),
('L07','طبقه هفتم',16,16),
('L08','طبقه هشتم',17,17),
('L09','طبقه نهم',18,18),
('L10','طبقه دهم',19,19),
('L11','طبقه یازدهم',20,20),
('L12','طبقه دوازدهم',21,21),
('L13','طبقه سیزدهم',22,22),
('L14','طبقه چهاردهم',23,23),
('L15','طبقه پانزدهم',24,24),
('L16','طبقه شانزدهم',25,25),
('L17','طبقه هفدهم',26,26),
('L18','طبقه هجدهم',27,27),
('L19','طبقه نوزدهم',28,28),
('L20','طبقه بیستم',29,29),
('L21','طبقه بیست و یکم',30,30),
('L22','طبقه بیست و دوم',31,31),
('L23','طبقه بیست و سوم',32,32),
('L24','طبقه بیست و چهارم',33,33),
('L25','طبقه بیست و پنجم',34,34),
('L26','طبقه بیست و ششم',35,35),
('L27','طبقه بیست و هفتم',36,36),
('RF1','بام',37,37),
('RF2','خرپشته',38,38);

COMMIT;
